{
  "backend/main.mo": "Main Motoko canister actor defining all core domain types (users, hotels, rooms, bookings, payments, invites, visibility) and state maps, and wiring in authorization, invite links, and migration logic.",
  "backend/migration.mo": "Defines data migration from an older canister schema to a newer one, adding room currency, payment instructions, and room_type fields while transforming hotel profiles and booking requests.",
  "feature_evidence.json": "Structured report mapping implemented product features to frontend files, components, test requirements, and confidence levels for traceability and audit purposes.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend React components, hooks, and pages describing routing, authentication, payments, admin behavior, and UI responsibilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles for the application.",
  "frontend/index.html": "HTML entry point for the React PWA with metadata, icons, manifest linkage, and root mount element.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app identity, display mode, theme colors, icons, scope, and localization for installation support.",
  "frontend/public/sw.js": "Service worker that caches core app assets on install, cleans old caches on activate, and uses a network-first fetch strategy with cache fallback and offline handling.",
  "frontend/REGRESSION_CHECKLIST.md": "Comprehensive pre-publish regression checklist covering routing, auth, query behavior, backend outage handling, error states, and booking flow validation.",
  "frontend/src/App.tsx": "Main application entry that configures React Query, routing with TanStack Router, theming, i18n, Internet Identity auth, PWA service worker registration, and global layout/providers.",
  "frontend/src/components/account/AccountStatusPanel.tsx": "Account status card showing Internet Identity principal details, admin indicators, refresh controls, and optional admin diagnostics with copy and toast feedback.",
  "frontend/src/components/account/AdminRecoveryReveal.tsx": "Admin-only card that exposes the admin recovery/reset flow for reassigning admin access to the current Internet Identity.",
  "frontend/src/components/account/PrePublishGateCard.tsx": "Pre-deployment checklist UI requiring a change summary and regression checks before marking a release as ready to publish.",
  "frontend/src/components/account/TroubleshootingSection.tsx": "Troubleshooting tools allowing users to reset React Query caches, unregister service workers, clear offline caches, and reload the app.",
  "frontend/src/components/admin/NextStepSelectorCard.tsx": "Renders an admin card with radio options to select and persist the next development priority using the useNextStep hook, including a loading state.",
  "frontend/src/components/admin/ResetAdminAccessCard.tsx": "Provides a form and confirmation flow to restore admin privileges using an admin token, handling success, errors, and navigation after reset.",
  "frontend/src/components/AppFooter.tsx": "Footer component displaying copyright text, a localized \"built with love\" message, and contact email links.",
  "frontend/src/components/AppHeader.tsx": "Top navigation header handling routing, authentication state, admin visibility, language selection, and responsive mobile menu UI.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper that renders the app header, routed page content via Outlet, and footer in a full-height flex column.",
  "frontend/src/components/auth/LoginButton.tsx": "Implements a login/logout button tied to Internet Identity authentication, handling loading states, errors, and query cache clearing on logout.",
  "frontend/src/components/auth/RequireActorReady.tsx": "Guards child routes until a backend actor is initialized, showing loading, error diagnostics with retry, or optional access warnings before rendering children.",
  "frontend/src/components/auth/RequireAuthenticated.tsx": "Protects content behind Internet Identity authentication, showing a login prompt or loading state until the user is authenticated.",
  "frontend/src/components/bookings/AdminBookingsPanel.tsx": "Displays a system-wide list of bookings for admins with status badges, counts, loading skeletons, error handling, and retry support.",
  "frontend/src/components/bookings/BookingDatePickerField.tsx": "Reusable date picker form field with label, validation, minimum date constraints, and popover calendar selection.",
  "frontend/src/components/bookings/BookingPaymentInstructions.tsx": "Renders manual payment instructions after a booking is submitted, including a payment email, booking reference details, and step-by-step guidance. Supports copying booking details to the clipboard with visual feedback and toast notifications, using i18n strings.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Implements a dialog flow for guests to request a hotel booking, handling form input, validation, authentication checks, and booking creation. Displays success, errors, and optionally manual payment instructions once a booking ID is returned.",
  "frontend/src/components/bookings/GuestBookingsSection.tsx": "Displays a guest-facing list of their booking requests with status badges, loading and error states, and refresh support. Allows guests to cancel pending bookings and navigate to browse hotels when no bookings exist.",
  "frontend/src/components/bookings/HotelBookingsSection.tsx": "Provides a hotel-facing management view of incoming booking requests, showing booking details, statuses, and actions to confirm or reject bookings. Handles loading, empty, and error states with retry support.",
  "frontend/src/components/common/PanelErrorBoundary.tsx": "A reusable React error boundary for admin or panel components that catches rendering errors and displays a fallback card UI. Supports resetting error state and optionally retrying the failed operation via a callback.",
  "frontend/src/components/diagnostics/RouteDiagnosticsErrorCard.tsx": "Renders a detailed diagnostic error page for route-level failures, integrating identity and actor status checks. Analyzes replica rejection errors (e.g., stopped canisters) and provides retry, copy, refresh, and troubleshooting navigation actions.",
  "frontend/src/components/hotel/AdminHotelInvitePanel.tsx": "Admin panel component for generating, listing, copying, and managing hotel invite tokens with loading, error, and refresh states.",
  "frontend/src/components/hotel/AdminHotelVisibilityPanel.tsx": "Admin panel for viewing and controlling hotel visibility, test status, and payment status, including diagnostics and toggle actions with feedback.",
  "frontend/src/components/hotel/GuestHotelRoomsDialog.tsx": "Dialog component for guests to browse a hotel’s available room types, photos, prices, and promotions in a scrollable layout.",
  "frontend/src/components/hotel/HotelInviteGate.tsx": "Access gate component that requires users to enter and validate a hotel invite token before accessing restricted hotel features.",
  "frontend/src/components/hotel/HotelProfileForm.tsx": "Form component for hotels to view and edit their profile details, including classification, location, country, and logo upload, with validation and save handling.",
  "frontend/src/components/hotel/HotelRoomsManager.tsx": "Manages hotel room inventory with CRUD functionality, including creating and editing rooms, uploading room photos with validation, and updating prices and promotions via backend hooks.",
  "frontend/src/components/hotel/RecordStayCard.tsx": "Provides a form for hotel staff to record a guest stay by principal ID and dates, performing client-side validation and creating stay records through a backend hook.",
  "frontend/src/components/payments/AdminPaymentReviewPanel.tsx": "Admin interface for reviewing all subscription payments, allowing confirmation or rejection, displaying status badges, and handling loading and error states.",
  "frontend/src/components/payments/PaymentInstructions.tsx": "Displays step-by-step payment instructions based on the selected payment option, showing amount and reference with copy-to-clipboard support.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Renders a selectable list of available payment methods using radio buttons and notifies the parent component of changes.",
  "frontend/src/components/profile/PrincipalIdPanel.tsx": "Shows the current user’s Internet Identity principal ID and allows copying it to the clipboard with visual feedback.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog that prompts new users to create their profile with name and email, auto-opening when no profile exists and saving data via backend hooks.",
  "frontend/src/components/stays/StayHistorySection.tsx": "React component that displays a caller's hotel stay history with loading skeletons, error retry UI, empty state, and a refresh indicator. Renders stay cards showing hotel info and formatted check-in/out dates using data from useGetCallerStayHistory.",
  "frontend/src/hooks/useAccountStatus.ts": "React Query hook that fetches the current caller's AccountStatus from the backend actor, scoped by principal ID to avoid cache leaks. Exposes combined loading state and refetch/isFetching for manual refresh UI.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on the current Internet Identity, initializing access control when authenticated. Automatically invalidates and refetches all non-actor queries when the actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Robust actor initialization hook that adds timeouts, backend health checks, retries, and non-blocking access control initialization. Exposes explicit actorReady, actorLoading, actorError, warnings, and a retry function for resilient UI usage.",
  "frontend/src/hooks/useAdminPayments.ts": "Admin hook for fetching all payment requests and confirming or rejecting them with timeout protection. Invalidates related payment, subscription, and status queries on mutation success.",
  "frontend/src/hooks/useAdminRecoveryDiagnostics.ts": "Admin hook that fetches backend recovery diagnostics scoped to the current principal. Supports conditional enabling and exposes refetch and isFetching for debug or status panels.",
  "frontend/src/hooks/useAdminReset.ts": "Mutation hook that restores admin access using a user-provided token via the backend actor. On success, it invalidates and refetches all relevant admin, account status, and diagnostics queries to refresh UI state.",
  "frontend/src/hooks/useBackendTestingMode.ts": "Hook that queries whether backend testing mode is enabled, using a health-verified actor with timeout protection. Caches the result briefly and merges actor initialization loading into the loading state.",
  "frontend/src/hooks/useBookings.ts": "Hooks for creating bookings and fetching a guest's bookings using the safe actor, with extensive error normalization for common booking failures. Invalidates guest booking queries after successful creation to keep lists in sync.",
  "frontend/src/hooks/useBrowseHotels.ts": "Guest-facing hooks for browsing hotels (all, by country, or with principals) using a safe, health-checked actor. Propagates actor initialization errors and merges actor loading state into query results.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides React Query hooks to fetch the current user's profile, role, and admin status scoped by principal, with careful loading/error handling and cache isolation. Includes logic to persist last-known admin status to keep admin UI stable during refetches.",
  "frontend/src/hooks/useHotelInvites.ts": "Defines hooks for checking invite status, consuming invite tokens, generating new hotel invite tokens, and fetching all tokens, all scoped per principal. Uses timeouts, optimistic cache updates, and targeted query invalidation to keep invite state consistent.",
  "frontend/src/hooks/useHotelProfile.ts": "Contains hooks to fetch and save the current hotel's profile for the logged-in principal. Uses React Query with timeouts, retries, optimistic cache updates, and preserved data during refetch to avoid blank UI states.",
  "frontend/src/hooks/useHotelVisibilityAdmin.ts": "Implements admin-only hooks to fetch hotel visibility/payment stats and mutate hotel visibility or payment status. Relies on scoped React Query caching, timeouts, and broad invalidation of hotel-related queries after updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY AuthClient, exposing identity state, login/logout methods, and detailed login status flags. Handles identity persistence, initialization, and delegation validation across reloads.",
  "frontend/src/hooks/useNextStep.ts": "A small hook that manages a user-selected \"next step\" option with localStorage persistence, scoped per principal when available. Handles loading, validation, and updates of the stored roadmap choice.",
  "frontend/src/hooks/usePaymentRequest.ts": "Provides hooks to create and fetch payment requests and to derive subscription status from payment history. Uses React Query to coordinate mutations, queries, and cache invalidation for payments and subscriptions.",
  "frontend/src/hooks/useRoomInventory.ts": "Defines React Query mutation hooks to update or delete a hotel's room inventory via a backend actor, with timeouts, error handling, and cache invalidation on success.",
  "frontend/src/hooks/useStayHistory.ts": "Provides hooks to fetch the caller’s stay history and create new stay records using React Query, scoped by identity and guarded by actor readiness with timeouts.",
  "frontend/src/hooks/useTestingMode.ts": "Implements a hook to toggle and persist a guest testing mode flag in localStorage, enabling visibility of test hotels when active.",
  "frontend/src/i18n/i18n.ts": "Implements a lightweight internationalization system with English and Indonesian dictionaries, translation lookup, and language persistence in localStorage.",
  "frontend/src/i18n/I18nProvider.tsx": "Defines an I18n context provider that manages the current language, persists it, and exposes a translation function to the app.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining a warm hospitality-themed design system, light/dark color variables, typography, layout safeguards, and mobile/iOS-specific fixes.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountStatusPage.tsx": "Renders the account status page with authentication and actor guards, showing account info and admin-only tools like recovery, pre-publish checks, and troubleshooting.",
  "frontend/src/pages/AdminPanelPage.tsx": "Implements the admin panel page with authentication, admin verification, multiple management panels, and robust loading/error handling including a watchdog timeout.",
  "frontend/src/pages/BrowseHotels.tsx": "Implements the hotel browsing page with search/filtering by country, testing mode handling, and loading/error states. Fetches hotel listings from the backend and renders booking and room dialogs with internationalized UI.",
  "frontend/src/pages/GuestAccountPage.tsx": "Renders the authenticated guest account dashboard showing profile info, bookings, and stay history. Handles loading, non-blocking errors, and provides CTAs to browse hotels and retry profile fetches.",
  "frontend/src/pages/GuestArea.tsx": "Public-facing guest landing area with calls to browse hotels and access account pages when authenticated. Displays marketing features and a welcome panel with principal ID for logged-in users.",
  "frontend/src/pages/HotelArea.tsx": "Main hotel operator dashboard that gates access by actor readiness and invite status, enforces profile setup and subscription checks, and provides tabs for bookings, rooms, and stay management. Includes consolidated diagnostics and retry flows for backend or permission errors.",
  "frontend/src/pwa/registerSW.ts": "Registers the PWA service worker on page load, periodically checks for updates, and logs when a new version is available. Gracefully handles registration failures with console warnings.",
  "frontend/src/utils/formatCurrency.ts": "Utility to format numeric or bigint amounts into localized currency strings based on supported room currencies. Falls back to default locale formatting for unknown currencies.",
  "frontend/src/utils/getErrorMessage.ts": "Normalizes unknown errors into user-friendly messages by detecting replica rejections, timeouts, validation, permission, and domain-specific backend errors. Filters out internal runtime details and returns safe, actionable text for UI display.",
  "frontend/src/utils/replicaRejection.ts": "Utility to analyze backend/replica errors, detect stopped canister (IC0508) and replica rejection patterns, extract canister IDs, and produce user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL parameters from query or hash routing, persist them in sessionStorage, retrieve/clear persisted values, and sanitize sensitive params from the URL.",
  "frontend/src/utils/withTimeout.ts": "Wraps a Promise with a timeout using Promise.race, rejecting with a configurable error message if the operation exceeds the specified duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container layout, extended theme tokens (colors, fonts, animations), and plugins like typography and container queries.",
  "project_state.json": "Project metadata and evolving state snapshot describing the SGO hotel booking app, including versioning, overall summary, and a catalog of implemented features with IDs and descriptions."
}