{
  "backend/main.mo": "Defines the canister actor and a large set of public Motoko types for users, hotels, bookings, payments, reviews, stays, visibility, and authorization-related structures.",
  "feature_evidence.json": "Feature-evidence report mapping feature IDs to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend source files, describing their functionality and purpose.",
  "frontend/index.css": "Tailwind-based global style definitions including light/dark OKLCH color tokens and base element styling.",
  "frontend/index.html": "HTML entry point defining metadata, PWA manifest links, icons, and mounting the React root.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, theme colors, and display properties.",
  "frontend/public/sw.js": "Service worker handling versioned caching, install/activate cleanup, navigation fallback, and network‑first static asset caching.",
  "frontend/REGRESSION_CHECKLIST.md": "Comprehensive pre‑publish regression checklist covering routing, auth, diagnostics, booking flows, and admin/non-admin behaviors.",
  "frontend/src/App.tsx": "Main app setup configuring routing, React Query, theming, identity provider, and service worker cleanup on startup.",
  "frontend/src/buildInfo.ts": "Generates build version and timestamp using environment variables or a fallback timestamp.",
  "frontend/src/components/account/AccountStatusPanel.tsx": "Panel showing Internet Identity status, build version, and optional admin diagnostics with refresh and copy actions.",
  "frontend/src/components/account/AdminRecoveryReveal.tsx": "Admin-only card for resetting admin access using a recovery token.",
  "frontend/src/components/account/PrePublishGateCard.tsx": "Warning card listing required features and checks before publishing the release.",
  "frontend/src/components/account/PublishingDeploymentHelpSection.tsx": "UI card with accordion-based instructions for deployment, troubleshooting failures, and fixing UI cache issues.",
  "frontend/src/components/account/TroubleshootingSection.tsx": "Provides buttons and dialogs to reset React Query cache, clear service workers, and wipe browser caches for troubleshooting.",
  "frontend/src/components/admin/NextStepSelectorCard.tsx": "Card allowing admins to select and persist a preferred next development feature via a radio-group interface.",
  "frontend/src/components/admin/ResetAdminAccessCard.tsx": "Form and dialog for restoring admin access using a token, including error handling, sanitization, and navigation.",
  "frontend/src/components/AppFooter.tsx": "Footer component displaying the current year and a link to caffeine.ai.",
  "frontend/src/components/AppHeader.tsx": "Header with navigation, language switcher, auth-aware links, and admin/ hotel area controls.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper combining header, routed content, and footer.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity auth flow and clearing cached queries.",
  "frontend/src/components/auth/RequireActorReady.tsx": "Gate component that shows loading, errors, or warnings based on backend actor readiness before rendering children.",
  "frontend/src/components/auth/RequireAuthenticated.tsx": "Wrapper requiring Internet Identity login, showing loading or login prompt until a user is authenticated.",
  "frontend/src/components/bookings/AdminBookingsPanel.tsx": "Displays all system bookings with status counts, loading/error handling, and scrollable booking cards.",
  "frontend/src/components/bookings/BookingDatePickerField.tsx": "Reusable date picker field with validation support, popover calendar, and optional minimum date restriction.",
  "frontend/src/components/bookings/BookingPaymentInstructions.tsx": "Shows manual payment instructions for a booking, including copyable booking details and step-by-step guidance.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Dialog for submitting a new booking request with form validation, date selection, room choice, and payment instructions flow.",
  "frontend/src/components/bookings/GuestBookingsSection.tsx": "Lists a guest's bookings with refresh, cancel actions, and loading/error states.",
  "frontend/src/components/bookings/HotelBookingsSection.tsx": "Displays hotel-specific bookings with actions to confirm, reject, cancel, or delete, plus full loading/error handling.",
  "frontend/src/components/common/PanelErrorBoundary.tsx": "React error boundary that catches rendering errors in panels and displays a retryable error card.",
  "frontend/src/components/diagnostics/RouteDiagnosticsErrorCard.tsx": "UI card that diagnoses route loading errors, shows replica rejection details, and provides retry, copy, and troubleshooting actions.",
  "frontend/src/components/hotel/AdminHotelInvitePanel.tsx": "Admin panel for viewing, generating, copying, and managing hotel invite tokens with loading and error states.",
  "frontend/src/components/hotel/AdminHotelVisibilityPanel.tsx": "Admin interface to view and modify hotel visibility, dummy status, and payment status with action controls and error handling.",
  "frontend/src/components/hotel/GuestHotelRoomsDialog.tsx": "Dialog displaying a hotel's room listings, photos, pricing, and optional payment instructions in a scrollable layout.",
  "frontend/src/components/hotel/HotelInviteGate.tsx": "Access gate requiring users to enter and validate a hotel invite token before accessing restricted hotel features.",
  "frontend/src/components/hotel/HotelProfileForm.tsx": "Form component for viewing and editing hotel profile details, including name, classification, address, logo, map link, and payment instructions.",
  "frontend/src/components/hotel/HotelRoomsManager.tsx": "Manages creation, editing, and deletion of hotel room inventory with image uploads, pricing, and promos.",
  "frontend/src/components/hotel/RecordStayCard.tsx": "Form for recording a guest stay by submitting principal ID and check‑in/out dates to the backend.",
  "frontend/src/components/payments/AdminPaymentReviewPanel.tsx": "Admin panel to view all payments and confirm or reject them with status badges and error handling.",
  "frontend/src/components/payments/PaymentInstructions.tsx": "Displays step‑by‑step payment instructions based on selected method along with reference and amount details.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Selector component allowing users to choose a payment method from PayPal, DANA, or GoPay.",
  "frontend/src/components/profile/PrincipalIdPanel.tsx": "Shows the user's principal ID and provides a button to copy it to the clipboard.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Renders a profile setup dialog that auto-opens for new users and allows submitting name and email to save a profile.",
  "frontend/src/components/reviews/ReviewsListCard.tsx": "Displays reviews for a target with loading, error, empty, and list states, including average rating and refresh support.",
  "frontend/src/components/reviews/ReviewSubmitCard.tsx": "Provides a form to submit a star rating and optional comment for a target entity, handling validation, submission, and errors.",
  "frontend/src/components/reviews/StarRatingField.tsx": "Shows interactive or read‑only star rating buttons with configurable size.",
  "frontend/src/components/stays/StayHistorySection.tsx": "Fetches and displays the user's stay history with loading, error, empty, and refresh states.",
  "frontend/src/hooks/useAccountStatus.ts": "React Query hook that fetches the authenticated user's account status, scoped by principal ID and exposing loading and refetch states.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Builds a backend actor with timeouts, health checks, optional access control init, and exposes readiness, errors, and retry logic.",
  "frontend/src/hooks/useAdminPayments.ts": "Fetches all payment requests and provides mutations to confirm or reject them with cache invalidation.",
  "frontend/src/hooks/useAdminRecoveryDiagnostics.ts": "Retrieves admin recovery diagnostics scoped by principal with controlled querying and state exposure.",
  "frontend/src/hooks/useAdminReset.ts": "Restores admin access using a token and invalidates all related admin and diagnostics queries.",
  "frontend/src/hooks/useBackendTestingMode.ts": "Queries backend testing-mode status with timeout protection and loading handling.",
  "frontend/src/hooks/useBookings.ts": "Creates bookings with detailed error normalization and fetches guest booking lists with principal-scoped cache keys.",
  "frontend/src/hooks/useBrowseHotels.ts": "Fetches hotel lists (all, with principals, or by country) using a safe actor and returns loading/error states.",
  "frontend/src/hooks/useCurrentUser.ts": "Gets current user profile, role, and admin status with principal-scoped caching and stable admin UI logic.",
  "frontend/src/hooks/useHotelAccess.ts": "Determines if a user can access hotel features based on invite or admin status and returns unified access flags.",
  "frontend/src/hooks/useHotelInvites.ts": "Checks invite status, consumes and generates invite tokens, and fetches all invite tokens with cache updates.",
  "frontend/src/hooks/useHotelProfile.ts": "Provides hooks to fetch and save a user's hotel profile with react‑query, handling caching, timeouts, and optimistic updates.",
  "frontend/src/hooks/useHotelVisibilityAdmin.ts": "Admin hooks to fetch all hotel visibility stats and mutate hotel visibility or payment status with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing identity loading, login, logout, and exposing identity state to components.",
  "frontend/src/hooks/useNextStep.ts": "Stores and retrieves a per‑user roadmap next‑step selection using localStorage scoped by principal.",
  "frontend/src/hooks/usePaymentRequest.ts": "Hooks to create payment requests, fetch a payment request, and determine subscription status via actor calls.",
  "frontend/src/hooks/useReviews.ts": "Hooks to submit reviews and fetch reviews by target or all reviews, with error handling and cache invalidation.",
  "frontend/src/hooks/useRoomInventory.ts": "Hooks to update or delete room inventory for a hotel and invalidate related hotel data caches.",
  "frontend/src/hooks/useStayHistory.ts": "Provides hooks to fetch a user’s stay history and create new stay records with appropriate cache updates.",
  "frontend/src/hooks/useTestingMode.ts": "Manages a persisted local testing‑mode flag that toggles visibility of dummy hotels.",
  "frontend/src/i18n/i18n.ts": "Defines a lightweight i18n system with English and Indonesian dictionaries and localStorage‑based language persistence.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides a language context with methods to change language and translate keys using stored preferences.",
  "frontend/src/index.css": "Sets up Tailwind base styles, color variables, typography rules, and iOS-specific layout fixes.",
  "frontend/src/lib/utils.ts": "Provides a helper function combining clsx and tailwind-merge for merging class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/AccountStatusPage.tsx": "Renders the account status view with admin-only troubleshooting, deployment help, and recovery sections.",
  "frontend/src/pages/AdminPanelPage.tsx": "Implements the admin dashboard with actor verification, watchdog timeout handling, and multiple admin management panels.",
  "frontend/src/pages/BrowseHotels.tsx": "Displays hotel listings with filtering, testing mode logic, and error handling using backend-driven data.",
  "frontend/src/pages/GuestAccountPage.tsx": "Renders the guest account page with profile, bookings, stays, reviews, and hotel selection, handling loading and profile fetch errors.",
  "frontend/src/pages/GuestArea.tsx": "Provides the guest landing area with navigation to browsing, account, status, and hotel-area options, showing identity info when logged in.",
  "frontend/src/pages/HotelArea.tsx": "Implements hotel management area with access checks, profile setup, subscription status, bookings, rooms, and reviews, handling loading and errors.",
  "frontend/src/pwa/cleanupServiceWorker.ts": "Unregisters service workers and clears caches once per version to fix stale SW issues, marking cleanup completion in localStorage.",
  "frontend/src/pwa/registerSW.ts": "Registers the service worker, tracks updates, and dispatches events when new SW versions are available, avoiding duplicate prompts.",
  "frontend/src/pwa/SwUpdatePrompt.tsx": "Empty file placeholder for service worker update prompt UI.",
  "frontend/src/utils/formatCurrency.ts": "Formats numeric amounts into localized currency strings based on RoomCurrency.",
  "frontend/src/utils/getErrorMessage.ts": "Normalizes unknown errors into readable user-facing messages with special handling for replica, timeout, validation, and internal errors.",
  "frontend/src/utils/replicaRejection.ts": "Analyzes error messages to detect replica rejection and stopped canister cases, extracting canister IDs and generating user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting with a custom error if it doesn't resolve in time.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project metadata, feature requirements, known issues, and pending revisions for the app state."
}