{
  "backend/main.mo": "Defines actor data types for users, hotels, bookings, payments, invites, and visibility, and initializes maps for storing profiles, tokens, and related records.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs for recent Account Status and publishing updates.",
  "frontend-file-summaries.txt": "Provides short summaries of various frontend components, hooks, and pages describing their purpose and key behaviors.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light/dark themes and applying base layout styles.",
  "frontend/index.html": "HTML entry page configuring meta tags, PWA manifest, icons, and loading the main React application root.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining name, description, theme colors, icons, categories, and start behavior for the SGO application.",
  "frontend/public/sw.js": "Implements a versioned service worker that precaches core assets, cleans old caches, and uses network‑first fetching with selective caching for static resources.",
  "frontend/REGRESSION_CHECKLIST.md": "Markdown checklist covering routes, authentication, Account Status role-based UI, backend-unavailable behavior, and booking flow tests before publishing.",
  "frontend/src/App.tsx": "Sets up the main app with routing, themes, React Query, identity, i18n, and runs service worker cleanup on startup.",
  "frontend/src/buildInfo.ts": "Generates and exports a build version and timestamp based on environment variables or a fallback value.",
  "frontend/src/components/account/AccountStatusPanel.tsx": "Displays Internet Identity account status, build version, and optional admin diagnostics with refresh and copy actions.",
  "frontend/src/components/account/AdminRecoveryReveal.tsx": "Shows an admin-only card for resetting admin access using a recovery token.",
  "frontend/src/components/account/PrePublishGateCard.tsx": "Provides a detailed pre‑publish checklist with verification steps and UI for tracking completion.",
  "frontend/src/components/account/PublishingDeploymentHelpSection.tsx": "UI card explaining how to deploy changes, retry failed deployments, and troubleshoot UI update issues.",
  "frontend/src/components/account/TroubleshootingSection.tsx": "Provides controls for clearing React Query cache and disabling offline caching via service worker and cache cleanup.",
  "frontend/src/components/admin/NextStepSelectorCard.tsx": "Lets admins select a prioritized next-step feature using a radio group, with saved local state and loading fallback.",
  "frontend/src/components/admin/ResetAdminAccessCard.tsx": "Form and dialog for restoring admin access via token, handling errors, sanitizing messages, and navigating after success.",
  "frontend/src/components/AppFooter.tsx": "Renders a simple footer with the current year and a caffeine.ai credit link.",
  "frontend/src/components/AppHeader.tsx": "Provides the main header with navigation, language selection, auth-aware links, and an admin badge/menu.",
  "frontend/src/components/AppLayout.tsx": "Defines the app’s page layout with header, main content outlet, and footer.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and automatic cache clearing on logout.",
  "frontend/src/components/auth/RequireActorReady.tsx": "Wrapper ensuring backend actor is initialized, showing loading, error, or warning states before rendering children.",
  "frontend/src/components/auth/RequireAuthenticated.tsx": "Gate component requiring Internet Identity login, showing a loading state or login prompt when unauthenticated.",
  "frontend/src/components/bookings/AdminBookingsPanel.tsx": "Displays all system bookings with loading, error, and scrollable list states, including status badges and retry handling.",
  "frontend/src/components/bookings/BookingDatePickerField.tsx": "Provides a labeled date picker field using a popover calendar with validation, disabled dates, and optional error display.",
  "frontend/src/components/bookings/BookingPaymentInstructions.tsx": "Shows manual payment instructions with booking details, copy-to-clipboard support, and localized text.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Implements a booking request modal with date selection, room type, guest input, validation, submission, and payment instructions flow.",
  "frontend/src/components/bookings/GuestBookingsSection.tsx": "Lists a guest's bookings with status indicators, cancellation support, loading/error states, and refresh actions.",
  "frontend/src/components/bookings/HotelBookingsSection.tsx": "Displays hotel-side booking requests with confirm/reject actions and full loading and error handling.",
  "frontend/src/components/common/PanelErrorBoundary.tsx": "React error boundary that catches panel rendering failures, shows a styled error card, and supports retrying via a callback.",
  "frontend/src/components/diagnostics/RouteDiagnosticsErrorCard.tsx": "Displays detailed routing and backend connection errors with retry options, copy helpers, and special handling for stopped canister states.",
  "frontend/src/components/hotel/AdminHotelInvitePanel.tsx": "Admin panel to generate, list, copy, and manage hotel invite tokens with loading, error, and refetch handling.",
  "frontend/src/components/hotel/AdminHotelVisibilityPanel.tsx": "Admin interface for toggling hotel visibility, test status, and payment state, wrapped in error handling and enriched with status badges and controls.",
  "frontend/src/components/hotel/GuestHotelRoomsDialog.tsx": "Dialog that displays a hotel’s room inventory with photos, pricing, and optional promotions in a scrollable layout.",
  "frontend/src/components/hotel/HotelInviteGate.tsx": "Restricted-access gate where hotels submit invite tokens for entry, showing validation, error feedback, and success handling.",
  "frontend/src/components/hotel/HotelProfileForm.tsx": "Form component that loads, edits, validates, and saves hotel profile details including name, classification, address, map link, country, and logo upload.",
  "frontend/src/components/hotel/HotelRoomsManager.tsx": "Manages creation, editing, and deletion of hotel room inventory with validation, image uploads, and modal dialog handling.",
  "frontend/src/components/hotel/RecordStayCard.tsx": "Provides a form to create guest stay records with principal validation and date handling before submitting to the backend.",
  "frontend/src/components/payments/AdminPaymentReviewPanel.tsx": "Admin interface for listing, confirming, and rejecting hotel subscription payments with loading and error states.",
  "frontend/src/components/payments/PaymentInstructions.tsx": "Displays payment instructions for a selected payment method along with reference details and copy-to-clipboard support.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Renders a radio-group selector for choosing a payment method such as PayPal, DANA, or GoPay.",
  "frontend/src/components/profile/PrincipalIdPanel.tsx": "Shows the user's Internet Identity principal ID and provides a button to copy it to the clipboard.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Displays a dialog prompting users to create a profile, auto-opening when no profile exists and handling form submission to save name and email.",
  "frontend/src/components/stays/StayHistorySection.tsx": "Fetches and displays the user's stay history with loading, error, empty, refresh, and list states.",
  "frontend/src/hooks/useAccountStatus.ts": "Queries the backend for the caller's account status, keyed by principal ID, with loading and refetch helpers.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Safely initializes a backend actor with timeouts, health checks, access control setup, and exposes readiness and error state.",
  "frontend/src/hooks/useAdminPayments.ts": "Provides admin APIs to list, confirm, and reject payment requests using actor-safe querying and mutations.",
  "frontend/src/hooks/useAdminRecoveryDiagnostics.ts": "Fetches admin recovery diagnostics for the current principal with optional enabling and scoped caching.",
  "frontend/src/hooks/useAdminReset.ts": "Handles restoring admin access via mutation and invalidates related admin and status queries on success.",
  "frontend/src/hooks/useBackendTestingMode.ts": "Retrieves backend testing-mode status with timeouts and actor-safe loading handling.",
  "frontend/src/hooks/useBookings.ts": "Provides hooks for creating bookings and fetching a caller's booking lists, including error normalization and cache invalidation.",
  "frontend/src/hooks/useBrowseHotels.ts": "Defines hooks to fetch hotel lists, optionally filtered by country or including principals, with actor readiness checks and retry handling.",
  "frontend/src/hooks/useCurrentUser.ts": "Contains hooks to load the current user's profile, role, and admin status with identity-scoped caching and timeout protection.",
  "frontend/src/hooks/useHotelAccess.ts": "Combines invite and admin checks to determine whether a user can access hotel-related areas and UI elements.",
  "frontend/src/hooks/useHotelInvites.ts": "Provides hooks for checking invite status, consuming invite tokens, generating new tokens, and listing all tokens with caching updates.",
  "frontend/src/hooks/useHotelProfile.ts": "Defines hooks for fetching and saving a hotel's profile with timeout protection and optimistic cache updates.",
  "frontend/src/hooks/useHotelVisibilityAdmin.ts": "Admin-focused hooks for retrieving hotel visibility stats and updating visibility or payment status with corresponding cache invalidations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and provider for Internet Identity authentication, exposing identity state, login, logout, and status helpers.",
  "frontend/src/hooks/useNextStep.ts": "Manages a per-user 'next step' roadmap selection with localStorage persistence, keyed by principal when available.",
  "frontend/src/hooks/usePaymentRequest.ts": "Defines React Query hooks for creating, fetching, and checking subscription status of payment requests via the backend actor.",
  "frontend/src/hooks/useRoomInventory.ts": "Offers mutations to update or delete room inventory with timeout handling and cache invalidation scoped by user identity.",
  "frontend/src/hooks/useStayHistory.ts": "Provides hooks to fetch and create stay history records, scoping queries by principal and using timeouts for backend calls.",
  "frontend/src/hooks/useTestingMode.ts": "Tracks a boolean testing mode flag with localStorage persistence and toggle support for showing test hotels.",
  "frontend/src/i18n/i18n.ts": "Defines a lightweight i18n system with EN/ID dictionaries and utilities for storing language preference.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context with language selection, persistence, and translation lookup for child components.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, color variables, layout rules, and mobile/iOS-specific adjustments.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entrypoint that initializes React, sets up QueryClient, wraps the app in InternetIdentityProvider, and loads global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Renders the account status page with panels, admin-only troubleshooting and recovery tools, and hash-based auto-scrolling.",
  "frontend/src/pages/AdminPanelPage.tsx": "Displays the admin control panel with multiple admin tools and a watchdog for admin verification timeouts.",
  "frontend/src/pages/BrowseHotels.tsx": "Lists hotels with filtering, testing mode handling, and booking dialogs, with error and loading states.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows guest account details, profile info, bookings, and stay history with loading and error handling.",
  "frontend/src/pages/GuestArea.tsx": "Landing page for guests offering navigation to browsing, account pages, and hotel area options based on authentication.",
  "frontend/src/pages/HotelArea.tsx": "Main hotel management page handling access checks, profile setup, subscription status, and rendering management tabs and components.",
  "frontend/src/pwa/cleanupServiceWorker.ts": "Utility that unregisters all service workers and clears caches once per version to fix stale SW issues.",
  "frontend/src/pwa/registerSW.ts": "Registers the service worker, checks for updates, and dispatches a custom event when a new version is available.",
  "frontend/src/pwa/SwUpdatePrompt.tsx": "Empty file placeholder for service worker update prompt UI.",
  "frontend/src/utils/formatCurrency.ts": "Formats numeric amounts into locale-specific currency strings based on RoomCurrency.",
  "frontend/src/utils/getErrorMessage.ts": "Normalizes various error types into user-friendly messages with special handling for IC, validation, timeout, and permission errors.",
  "frontend/src/utils/replicaRejection.ts": "Detects IC replica rejection or stopped-canister errors and extracts canister IDs to produce clearer error info.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and persisting URL parameters across navigation, including hash-based routing.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects with a custom error if it exceeds a specified duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Tracks project state for an SGO web app, listing current UI cleanup tasks, deployment issues, and pending feature requests."
}