{
  "backend/main.mo": "Main Motoko canister defining core domain models (users, hotels, bookings, payments, stays, invites) and persistent state maps, integrating authorization, access control, invite links, and exposing backend actor APIs including a health check.",
  "feature_evidence.json": "Structured report documenting frontend reliability features, mapping feature IDs to affected files, components, test requirements, and confidence levels for backend-stopped diagnostics and actor readiness handling.",
  "frontend-file-summaries.txt": "Generated inventory of frontend source files with concise descriptions of each component, hook, page, and their responsibilities for routing, auth, payments, admin flows, and error handling.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens using OKLCH color variables, light/dark themes, and base styles for consistent UI theming.",
  "frontend/index.html": "HTML entry point for the React app with PWA metadata, icons, manifest linkage, and root mounting element.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app identity, icons, theme colors, display mode, categories, and localization for installation support.",
  "frontend/public/sw.js": "Service worker implementing basic PWA caching with install/activate lifecycle handling, network-first fetch strategy, offline fallback, and cache versioning.",
  "frontend/REGRESSION_CHECKLIST.md": "Pre-publish regression checklist covering routes, authentication, query behavior, stopped-backend diagnostics, recovery actions, access control warnings, and guest booking flows.",
  "frontend/src/App.tsx": "Application entry point that sets up React Query, TanStack Router routes, theme provider, Internet Identity context, PWA service worker, and global toaster.",
  "frontend/src/components/account/AccountStatusPanel.tsx": "Displays the authenticated user's Internet Identity account details, admin status, and optional admin diagnostics with refresh, copy, and troubleshooting actions.",
  "frontend/src/components/account/AdminRecoveryReveal.tsx": "Admin-only card that exposes tools to reset or recover admin access using a recovery token.",
  "frontend/src/components/account/PrePublishGateCard.tsx": "Checklist-driven pre-publish gate requiring a change summary and regression checks before deployment.",
  "frontend/src/components/account/TroubleshootingSection.tsx": "Provides troubleshooting tools to reset React Query caches, unregister service workers, clear offline caches, and reload the app.",
  "frontend/src/components/admin/NextStepSelectorCard.tsx": "Renders an admin card with radio options to select and persist the next development priority, showing a loading state while the selection is fetched.",
  "frontend/src/components/admin/ResetAdminAccessCard.tsx": "Provides a UI to restore admin privileges using an admin token, handling validation, errors, success feedback, and redirecting after reset.",
  "frontend/src/components/AppFooter.tsx": "Simple footer component displaying copyright text and a contact email.",
  "frontend/src/components/AppHeader.tsx": "Responsive top navigation bar that shows routes and actions based on authentication and admin status, including mobile menu handling and admin verification error states.",
  "frontend/src/components/AppLayout.tsx": "Root layout component that wraps pages with a persistent header, footer, and routed main content outlet.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button for Internet Identity that handles authentication state, loading indicators, and query cache clearing on logout.",
  "frontend/src/components/auth/RequireActorReady.tsx": "Gate component that renders children only when the backend actor is ready, otherwise showing loading, error diagnostics, or warnings with retry support.",
  "frontend/src/components/auth/RequireAuthenticated.tsx": "Protects routes by requiring an authenticated Internet Identity, showing loading, login prompt, or rendering children accordingly.",
  "frontend/src/components/bookings/AdminBookingsPanel.tsx": "Admin panel that fetches and displays all bookings with status badges, loading skeletons, error handling, and retry support.",
  "frontend/src/components/bookings/BookingDatePickerField.tsx": "Reusable date picker form field with label, popover calendar, min-date validation, disabled state, and inline error display.",
  "frontend/src/components/bookings/BookingPaymentInstructions.tsx": "Displays manual payment instructions after a booking is created, including a payment email, booking reference details, and a copy-to-clipboard action with toast feedback.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Provides a dialog for authenticated users to create a booking request with date and guest validation, submits the booking via hooks, and conditionally shows payment instructions or errors.",
  "frontend/src/components/bookings/GuestBookingsSection.tsx": "Shows a guest-facing list of their booking requests with status badges, loading/error states, refresh support, and the ability to cancel bookings.",
  "frontend/src/components/bookings/HotelBookingsSection.tsx": "Renders hotel-side management of incoming booking requests, allowing confirmation or rejection of bookings with status indicators and error handling.",
  "frontend/src/components/common/PanelErrorBoundary.tsx": "Implements a React error boundary for admin panels that catches rendering errors and shows a retryable fallback UI with error details.",
  "frontend/src/components/diagnostics/RouteDiagnosticsErrorCard.tsx": "Displays a detailed diagnostic error card for route-level failures, analyzing backend/replica errors, showing identity and canister info, and offering retry and troubleshooting actions.",
  "frontend/src/components/hotel/AdminHotelInvitePanel.tsx": "Admin panel component to generate, list, copy, and manage hotel invite tokens using backend hooks, with loading, error, and refetch states plus clipboard support.",
  "frontend/src/components/hotel/AdminHotelVisibilityPanel.tsx": "Admin interface for viewing all hotels and toggling visibility, test/dummy status, and payment status, with badges, controls, and diagnostic/error handling.",
  "frontend/src/components/hotel/GuestHotelRoomsDialog.tsx": "Dialog component for guests to view a hotel’s available room types, photos, pricing, and promotions in a scrollable card-based layout.",
  "frontend/src/components/hotel/HotelInviteGate.tsx": "Access gate that requires users to submit and validate a hotel invite token before entering the hotel area, with form validation and success/error feedback.",
  "frontend/src/components/hotel/HotelProfileForm.tsx": "Form for hotel owners to view and edit their hotel profile details (name, classification, location, country, logo), mapping UI values to backend enums and saving via hooks.",
  "frontend/src/components/hotel/HotelRoomsManager.tsx": "Provides a UI for hotel owners to create, edit, and delete room inventory, including pricing, promos, and photo uploads with validation. Integrates with hotel profile, room inventory hooks, and Internet Identity for authenticated updates.",
  "frontend/src/components/hotel/RecordStayCard.tsx": "Form component that allows a hotel to record a guest’s stay by entering the guest’s Principal ID and check-in/out dates. Performs client-side validation and submits the stay record via a backend mutation.",
  "frontend/src/components/payments/AdminPaymentReviewPanel.tsx": "Admin dashboard panel for reviewing all subscription payments and confirming or rejecting them. Handles loading, error, and retry states and displays payment status badges in a table.",
  "frontend/src/components/payments/PaymentInstructions.tsx": "Displays step-by-step payment instructions based on the selected payment option, including amount and reference code. Supports copying the payment reference to the clipboard with user feedback.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Selector component that lets users choose a payment method (PayPal, DANA, or GoPay) using radio buttons. Emits the selected PaymentOption to a parent component.",
  "frontend/src/components/profile/PrincipalIdPanel.tsx": "Shows the currently authenticated user’s Internet Identity Principal ID and allows copying it to the clipboard. Hidden when no identity is available.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog that prompts new users to create their profile with name and email after first login. Auto-opens when no profile exists and saves data via a backend mutation.",
  "frontend/src/components/stays/StayHistorySection.tsx": "React component that displays the caller’s hotel stay history with loading skeletons, error/empty states, manual refresh, and a list UI showing hotel details and formatted check-in/out dates.",
  "frontend/src/hooks/useAccountStatus.ts": "React Query hook that fetches the authenticated user’s account status from the backend, scoped by principal ID, with short caching and manual refetch support.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorSafe.ts": "Robust actor initialization hook that adds timeouts, backend health checks, non-blocking access control setup, retry logic, and exposes explicit readiness/loading/error state.",
  "frontend/src/hooks/useAdminPayments.ts": "Admin hook to fetch all payment requests and confirm or reject them, using safe actor initialization and invalidating related payment and subscription queries on mutation success.",
  "frontend/src/hooks/useAdminRecoveryDiagnostics.ts": "Admin-only hook that retrieves backend recovery diagnostics for the current principal, with controlled enabling, short caching, and manual refetch support.",
  "frontend/src/hooks/useAdminReset.ts": "Mutation hook that restores admin access using a user-provided token and aggressively invalidates and refetches admin- and account-related queries afterward.",
  "frontend/src/hooks/useBookings.ts": "Hooks for creating guest booking requests (with enhanced error handling and testing-mode support) and for fetching the caller’s processing bookings with timeout protection.",
  "frontend/src/hooks/useBrowseHotels.ts": "Guest-facing hooks to browse hotels (all, by country, or with principals) using a health-verified actor, with retries and propagation of actor initialization errors.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides React Query hooks to fetch the current user's profile, role, and admin status scoped by Principal ID, with careful loading and cache handling. Includes admin verification logic with timeouts, retries, and UI-stability via last-known admin state.",
  "frontend/src/hooks/useHotelInvites.ts": "Defines hooks to check invite status, consume invite tokens, generate new invite tokens, and fetch all tokens using React Query. Queries and mutations are scoped per Principal ID with timeouts, optimistic updates, and cache invalidation.",
  "frontend/src/hooks/useHotelProfile.ts": "Implements hooks to fetch and save a hotel profile for the current identity using React Query. Uses timeouts, optimistic cache updates, and preserves previous data during refetch to avoid blank UI states.",
  "frontend/src/hooks/useHotelVisibilityAdmin.ts": "Provides admin-only hooks to fetch hotel visibility/payment stats and update hotel visibility or payment status. Uses React Query with scoped caching, timeouts, and broad cache invalidation for hotel-related data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider that manages authentication state, login/logout, and identity persistence using Dfinity AuthClient. Exposes identity, login helpers, and detailed login status flags to consumers.",
  "frontend/src/hooks/useNextStep.ts": "Manages a locally persisted \"next step\" roadmap selection, scoped per Principal ID when available. Loads and saves the selection to localStorage and exposes loading and update helpers.",
  "frontend/src/hooks/usePaymentRequest.ts": "Defines hooks to create and fetch payment requests and to derive subscription status based on payment history. Uses React Query to coordinate backend calls and invalidate related caches on payment changes.",
  "frontend/src/hooks/useRoomInventory.ts": "Provides React Query mutations to update and delete room inventory via a backend actor, with timeout handling, error normalization, and cache invalidation for hotel-related queries.",
  "frontend/src/hooks/useStayHistory.ts": "Defines hooks to fetch the caller’s stay history and create new stay records using React Query, scoped by identity principal and protected with actor readiness and timeouts.",
  "frontend/src/hooks/useTestingMode.ts": "Manages a persisted testing mode flag in localStorage, allowing toggling of guest access to dummy/test hotels.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining a warm hospitality-themed design system, light/dark mode variables, typography, layout safeguards, and iOS-specific fixes.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Renders the Account Status page with authenticated and actor-ready guards, showing account info and admin-only panels such as recovery, roadmap planning, and troubleshooting.",
  "frontend/src/pages/AdminPanelPage.tsx": "Implements the admin dashboard with authentication checks, admin verification watchdog logic, error diagnostics, and panels for hotels, bookings, payments, and roadmap selection.",
  "frontend/src/pages/BrowseHotels.tsx": "Displays a browsable and filterable list of hotels for guests, supporting testing mode, country filtering, loading/error states, and booking-related dialogs.",
  "frontend/src/pages/GuestAccountPage.tsx": "Implements the authenticated guest account page showing profile info, principal ID, bookings, and stay history with loading states and retryable error handling. Includes a CTA to browse hotels and integrates multiple auth and data hooks.",
  "frontend/src/pages/GuestArea.tsx": "Public-facing guest landing page with a hero section, feature highlights, and conditional authenticated panel showing principal ID and navigation to guest account pages. Uses Internet Identity to detect authentication state.",
  "frontend/src/pages/HotelArea.tsx": "Main hotel dashboard handling actor readiness, invite gating, profile setup, subscription checks, and bookings management. Orchestrates multiple hooks and renders diagnostics, onboarding flows, and hotel management sections.",
  "frontend/src/pwa/registerSW.ts": "Registers a service worker on window load, periodically checks for updates, and logs when a new version is available. Provides basic error handling for failed registration.",
  "frontend/src/utils/getErrorMessage.ts": "Normalizes unknown errors into user-friendly messages by detecting timeouts, validation issues, authorization problems, invite errors, and replica rejections. Centralizes error messaging for UI toasts and inline alerts.",
  "frontend/src/utils/replicaRejection.ts": "Analyzes errors to detect Internet Computer replica rejections, especially stopped canister cases, and extracts canister IDs when possible. Produces structured metadata and user-friendly fallback messages.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them with URL taking precedence. Includes helpers for safely storing/removing session values and sanitizing sensitive params from the URL hash.",
  "frontend/src/utils/withTimeout.ts": "Defines a helper that wraps a Promise with a timeout using Promise.race, rejecting with a configurable error if the operation exceeds the specified duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend source files, and extending the theme with custom OKLCH color tokens, typography, container queries, animations, fonts, and layout defaults.",
  "project_state.json": "Tracks overall project metadata and evolution state, including schema/versioning, a narrative summary of the SGO hotel booking app, and a structured list of existing features with IDs, descriptions, and requirement links."
}