{
  "backend/main.mo": "Defines the backend actor with data types for users, hotels, bookings, payments, invites, and internal maps for storing profiles, requests, and visibility.",
  "feature_evidence.json": "Contains feature evidence metadata listing implemented features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides summaries of major frontend files, describing their responsibilities across routing, UI components, hooks, pages, and global styling.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes and applying base styling.",
  "frontend/index.html": "Main HTML entrypoint configuring meta tags, PWA setup, icons, and loading the React application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, categories, and language settings.",
  "frontend/public/sw.js": "Service worker implementing install, activate, and fetch handlers with network-first caching and offline fallbacks.",
  "frontend/REGRESSION_CHECKLIST.md": "A detailed pre-publish regression checklist covering routing, authentication, error handling, backend-unavailable behavior, and booking flow tests.",
  "frontend/src/App.tsx": "Sets up the main React app with routing, theming, query client, identity, i18n, and layout components.",
  "frontend/src/components/account/AccountStatusPanel.tsx": "Displays the user's Internet Identity status with principal ID, admin diagnostics, and refresh actions.",
  "frontend/src/components/account/AdminRecoveryReveal.tsx": "Shows an admin-only card for resetting admin access using a recovery token.",
  "frontend/src/components/account/PrePublishGateCard.tsx": "Provides a pre-deployment checklist and summary form to verify readiness before publishing.",
  "frontend/src/components/account/PublishingDeploymentHelpSection.tsx": "Offers guidance on deployment steps, retrying failed publishes, and troubleshooting update visibility.",
  "frontend/src/components/account/TroubleshootingSection.tsx": "Provides UI tools to reset React Query cache and disable offline caches by unregistering service workers and clearing browser cache.",
  "frontend/src/components/admin/NextStepSelectorCard.tsx": "Shows a selectable list of roadmap priorities and saves the chosen next‑step option using a custom hook.",
  "frontend/src/components/admin/ResetAdminAccessCard.tsx": "Allows users to restore admin access using a token, handles errors safely, and redirects to the hotel area after success.",
  "frontend/src/components/AppFooter.tsx": "Renders the site footer with localized text, branding, and contact email.",
  "frontend/src/components/AppHeader.tsx": "Implements the top navigation bar with authentication-aware links, admin access, language switching, and mobile menu.",
  "frontend/src/components/AppLayout.tsx": "Provides the shared page layout containing header, routed content, and footer.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with status indicators and clears React Query cache on logout.",
  "frontend/src/components/auth/RequireActorReady.tsx": "Gates child components on actor initialization state, showing loading, error diagnostics, or warnings as needed.",
  "frontend/src/components/auth/RequireAuthenticated.tsx": "Protects routes by requiring Internet Identity authentication and displays a login prompt when unauthenticated.",
  "frontend/src/components/bookings/AdminBookingsPanel.tsx": "Displays all bookings with status badges, loading/error states, and a scrollable list with retry support.",
  "frontend/src/components/bookings/BookingDatePickerField.tsx": "A date picker field component using a popover calendar, supporting min-date validation and error display.",
  "frontend/src/components/bookings/BookingPaymentInstructions.tsx": "Shows payment instructions for a booking, including copy‑to‑clipboard booking details and manual payment steps.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Dialog for submitting booking requests with form validation, booking creation, and optional payment instructions.",
  "frontend/src/components/bookings/GuestBookingsSection.tsx": "Displays a guest's bookings with status, loading/error states, refresh, and cancellation functionality.",
  "frontend/src/components/bookings/HotelBookingsSection.tsx": "Lists hotel booking requests with status and allows hotel staff to confirm or reject them.",
  "frontend/src/components/common/PanelErrorBoundary.tsx": "Error boundary that catches panel rendering errors and displays a retryable fallback UI.",
  "frontend/src/components/diagnostics/RouteDiagnosticsErrorCard.tsx": "Displays a detailed error card for route failures with retry, copy IDs, stopped-canister detection, and troubleshooting navigation.",
  "frontend/src/components/hotel/AdminHotelInvitePanel.tsx": "Admin interface to generate, view, copy, and manage hotel invite tokens with loading and error handling.",
  "frontend/src/components/hotel/AdminHotelVisibilityPanel.tsx": "Admin panel for toggling hotel visibility, test mode, and payment status, with batch stats loading and error boundaries.",
  "frontend/src/components/hotel/GuestHotelRoomsDialog.tsx": "Dialog showing a hotel's room list with photos, pricing, promos, and empty-state messaging.",
  "frontend/src/components/hotel/HotelInviteGate.tsx": "Gate component requiring and validating an invite token before accessing the hotel area, with form submission and error toasts.",
  "frontend/src/components/hotel/HotelProfileForm.tsx": "Form for viewing and editing hotel profile details including name, classification, address, country, and logo upload with mapping helpers for classification values.",
  "frontend/src/components/hotel/HotelRoomsManager.tsx": "UI for creating, editing, and deleting room inventory with image upload, validation, and integration with backend update/delete hooks.",
  "frontend/src/components/hotel/RecordStayCard.tsx": "Card form to create a guest stay record with principal validation and check‑in/out date handling.",
  "frontend/src/components/payments/AdminPaymentReviewPanel.tsx": "Admin panel to list, confirm, and reject subscription payments with status badges and error handling.",
  "frontend/src/components/payments/PaymentInstructions.tsx": "Displays payment instructions for PayPal, DANA, or GoPay along with reference copying and required steps.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Selector component for choosing a payment method via radio buttons for PayPal, DANA, or GoPay.",
  "frontend/src/components/profile/PrincipalIdPanel.tsx": "Shows the user's principal ID with a copy‑to‑clipboard button and simple feedback state.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new users to enter name and email, saving the profile via a mutation and auto-opening when no profile exists.",
  "frontend/src/components/stays/StayHistorySection.tsx": "Displays caller stay history with loading skeletons, error handling with retry, empty state, and a formatted list of stays.",
  "frontend/src/hooks/useAccountStatus.ts": "Fetches the current user's account status using the safe actor, keyed by principal ID, with loading and refetch helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user identity, reinitializing on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useActorSafe.ts": "Initializes a backend actor with timeouts, health checks, optional access-control setup, and exposes actor state and retry logic.",
  "frontend/src/hooks/useAdminPayments.ts": "Provides admin APIs for listing, confirming, and rejecting payment requests using the safe actor with query invalidation.",
  "frontend/src/hooks/useAdminRecoveryDiagnostics.ts": "Fetches admin recovery diagnostics keyed by principal ID when enabled and actor is ready.",
  "frontend/src/hooks/useAdminReset.ts": "Mutation to restore admin access and invalidate/refetch related admin and account-status queries.",
  "frontend/src/hooks/useBackendTestingMode.ts": "Fetches the backend testing-mode flag via the safe actor with timeout and caching.",
  "frontend/src/hooks/useBookings.ts": "Provides hooks for creating bookings with detailed error handling and fetching a guest’s bookings using React Query.",
  "frontend/src/hooks/useBrowseHotels.ts": "Exports hooks to load hotels, including all hotels, hotels with principals, and hotels filtered by country.",
  "frontend/src/hooks/useCurrentUser.ts": "Defines hooks for fetching the current user profile, role, and admin status with identity‑scoped caching and timeout handling.",
  "frontend/src/hooks/useHotelAccess.ts": "Combines invite and admin checks to determine whether a user can access hotel‑restricted areas.",
  "frontend/src/hooks/useHotelInvites.ts": "Implements invite‑related queries and mutations, including checking invite status, consuming tokens, generating tokens, and listing tokens.",
  "frontend/src/hooks/useHotelProfile.ts": "Provides hooks to fetch and save a hotel’s profile with optimistic updates and timeout protection.",
  "frontend/src/hooks/useHotelVisibilityAdmin.ts": "Contains admin‑level hooks for fetching hotel visibility stats and updating hotel visibility or payment status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth state, loading stored identities, and triggering login/logout via AuthClient.",
  "frontend/src/hooks/useNextStep.ts": "Manages a user's selected roadmap step with localStorage persistence scoped by principal ID.",
  "frontend/src/hooks/usePaymentRequest.ts": "Hooks for creating and fetching payment requests and determining subscription status using actor canister calls.",
  "frontend/src/hooks/useRoomInventory.ts": "Provides mutations to update or delete room inventory and invalidates related hotel queries on success.",
  "frontend/src/hooks/useStayHistory.ts": "Fetches stay history scoped by principal and allows creating new stay records with query invalidation.",
  "frontend/src/hooks/useTestingMode.ts": "Manages a locally persisted testing mode flag for showing test hotels.",
  "frontend/src/i18n/i18n.ts": "Defines translation dictionaries, language persistence, and a translation helper for EN/ID.",
  "frontend/src/i18n/I18nProvider.tsx": "Supplies an i18n context with language state, persistence, and translation lookup.",
  "frontend/src/index.css": "Tailwind-based global styles with light theme variables, layout fixes, and iOS-specific adjustments.",
  "frontend/src/lib/utils.ts": "Utility function merging Tailwind classes using clsx and twMerge.",
  "frontend/src/main.tsx": "Application entry point initializing React, react-query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AccountStatusPage.tsx": "Renders the account status page with panels for status, publishing help, and admin-only tools like roadmap planning, recovery, and pre‑publish checks. Includes hash‑based scrolling and conditional admin sections.",
  "frontend/src/pages/AdminPanelPage.tsx": "Implements the admin panel with admin verification, watchdog timeout handling, and panels for diagnostics, hotel management, payments, bookings, and next‑step selection. Handles multiple terminal states for loading and errors.",
  "frontend/src/pages/BrowseHotels.tsx": "Displays a hotel browsing interface with filtering, testing‑mode logic, and detailed hotel listings. Handles loading, backend testing‑mode mismatch warnings, and error states with retry support.",
  "frontend/src/pages/GuestAccountPage.tsx": "Shows the guest account dashboard with profile info, bookings, stay history, and booking CTA, including loading skeletons and retryable profile‑load errors. Provides navigation to browsing and displays principal ID details.",
  "frontend/src/pages/GuestArea.tsx": "Serves as the guest landing area with CTAs for browsing hotels, accessing account pages, and hotel‑area access when permitted. Shows authentication‑aware actions and a principal ID panel for logged‑in users.",
  "frontend/src/pages/HotelArea.tsx": "Main hotel management page handling access checks, profile setup, subscription status, and rendering management tabs.",
  "frontend/src/pwa/registerSW.ts": "Registers a service worker, checks for updates, and logs update availability.",
  "frontend/src/utils/formatCurrency.ts": "Formats numeric amounts into localized currency strings based on RoomCurrency.",
  "frontend/src/utils/getErrorMessage.ts": "Normalizes various error types into user-friendly messages with special handling for timeouts, permissions, and canister issues.",
  "frontend/src/utils/replicaRejection.ts": "Identifies replica rejection and stopped-canister errors and extracts canister IDs for clearer diagnostics.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Adds a timeout to a promise, rejecting with a custom error if exceeded.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines current project state, including existing features, pending new requests, and notes about build/deploy failures. Used to track app functionality, issues, and required updates."
}