{
  "kind": "build_request",
  "title": "Hide Account Status technical sections for non-admin users and prepare Draft v53 for live publishing",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Account Status page to hide the \"Troubleshooting\" section from non-admin authenticated users; only admins should be able to see and use Troubleshooting tools.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-19"
        ],
        "quotes": [
          "YA LAKUKAN PRUBAHAN SESUAI DENGAN APA YANG SUDAG KITA BAHAS, MASA SAYA HARUS MENGULANG-ULANG SIH"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as a non-admin user, the Account Status page does not render the Troubleshooting header, description, content, or its surrounding Separator(s).",
        "When logged in as an admin, the Troubleshooting section renders exactly as before and remains functional.",
        "Non-admin users do not see any button or link that scrolls to #troubleshooting."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Account Status page to hide the \"Publishing & Deployment\" help section from non-admin authenticated users; only admins should be able to see Publishing/Deployment guidance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-19"
        ],
        "quotes": [
          "YA LAKUKAN PRUBAHAN SESUAI DENGAN APA YANG SUDAG KITA BAHAS, MASA SAYA HARUS MENGULANG-ULANG SIH"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as a non-admin user, the Account Status page does not render the Publishing & Deployment card or its surrounding Separator(s).",
        "When logged in as an admin, the Publishing & Deployment card renders and behaves as before (including any scroll-to-troubleshooting behavior)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Revise the Account Status page header/subtitle copy so it no longer advertises troubleshooting tools to non-admin users, while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-19"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "For non-admin users, the Account Status page subtitle does not mention troubleshooting or deployment tools.",
        "For admin users, the page may mention admin tools if desired, but all displayed text remains English."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Perform the platform publishing step to publish the currently deployed Draft Version 53 to live/production after applying the agreed UI changes.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-14",
          "msg-19"
        ],
        "quotes": [
          "publish skarang",
          "ya sudah laukan publish live nya'",
          "YA LAKUKAN PRUBAHAN SESUAI DENGAN APA YANG SUDAG KITA BAHAS, MASA SAYA HARUS MENGULANG-ULANG SIH"
        ]
      },
      "acceptanceCriteria": [
        "A live/production link is produced by the platform after the publish operation completes successfully.",
        "The live version reflects the Account Status page changes from REQ-1 and REQ-2 (non-admin users no longer see Troubleshooting or Publishing & Deployment sections)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI component sources).",
    "Do not modify any paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Keep backend as a single Motoko actor (no additional backend services).",
    "All user-facing text must be English."
  ],
  "nonGoals": [
    "Do not add new authentication methods (Internet Identity remains the only auth method).",
    "Do not introduce new features unrelated to Account Status page cleanup or publishing Draft v53.",
    "Do not add external databases or third-party backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}