{
  "kind": "build_request",
  "title": "Add in-app publishing guidance and deploy-failure retry instructions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an in-app “Publishing & Deployment” help section that explains (in English) how to publish the app and what to do if a deploy/build fails, including a clear instruction that if deployment fails the user should rerun deployment, and a checklist for what to try when changes are not visible after a successful deploy (hard refresh, reset app cache, disable offline cache/service worker). Place this section on the Account Status page so it is easy to find.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bagaimana publish nya? jika deploy gagal di ulangi lagi saja."
        ]
      },
      "acceptanceCriteria": [
        "Account Status page includes a clearly titled “Publishing & Deployment” section with step-by-step guidance written in English.",
        "The guidance explicitly covers: (1) how to publish/deploy, (2) what to do when deploy fails (retry/rerun deployment), and (3) what to do when the deploy succeeds but UI doesn’t update (hard refresh + cache/service worker actions).",
        "The section contains a direct link/button that scrolls/navigates to the existing Troubleshooting tools on the same page (or opens them via the existing #troubleshooting anchor)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Extend the existing Pre-Publish Gate UI to include a small “Post-deploy verification” subsection (English) with 3–5 checkboxes focused on confirming the new version is actually live (e.g., verify footer/version-visible change, reload without stale cache, confirm key routes load). Include a short note that if verification fails due to stale assets, use the Troubleshooting tools to clear caches and then retry verification.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bagaimana publish nya? jika deploy gagal di ulangi lagi saja."
        ]
      },
      "acceptanceCriteria": [
        "Pre-Publish Gate shows a dedicated post-deploy verification subsection with checkboxes.",
        "Copy is in English and explicitly mentions using Troubleshooting actions if the new build appears not to be live due to caching.",
        "There is a link/button from the Pre-Publish Gate area to the Troubleshooting section (or the Account Status troubleshooting anchor)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn components must be composed, not modified).",
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths)."
  ],
  "nonGoals": [
    "Do not implement actual automated deployment/publishing or CI logic; only add in-app guidance and verification UI.",
    "Do not add new authentication providers or payment methods."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}