{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Account Status: hide admin technical sections for non-admin users and prep Draft v53 publish checklist",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Hide the Account Status “Troubleshooting” section (including separators and any #troubleshooting affordances) from non-admin authenticated users using role-based UI gating.",
      "acceptanceCriteria": [
        "When logged in as a non-admin user, the Account Status page does not render the Troubleshooting header, description, content, or its surrounding Separator(s).",
        "When logged in as an admin, the Troubleshooting section renders exactly as before and remains functional.",
        "Non-admin users do not see any button or link that scrolls to #troubleshooting."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AccountStatusPage.tsx",
          "operation": "modify",
          "description": "Use the authorization component’s role-based access (via existing useAccountStatus() -> callerIsAdmin) to conditionally render the Troubleshooting wrapper block and its surrounding Separator only for admins; ensure the non-admin view has no element with id=\"troubleshooting\" and no UI that references #troubleshooting. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Hide the Account Status “Publishing & Deployment” help section from non-admin authenticated users while keeping admin behavior unchanged.",
      "acceptanceCriteria": [
        "When logged in as a non-admin user, the Account Status page does not render the Publishing & Deployment card or its surrounding Separator(s).",
        "When logged in as an admin, the Publishing & Deployment card renders and behaves as before (including any scroll-to-troubleshooting behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AccountStatusPage.tsx",
          "operation": "modify",
          "description": "Use the authorization component’s role-based access (via existing useAccountStatus() -> callerIsAdmin) to conditionally render PublishingDeploymentHelpSection and its surrounding Separator only for admins; keep the component behavior unchanged for admins. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Revise Account Status header/subtitle copy to avoid advertising admin troubleshooting/deployment tools to non-admin users, keeping all user-facing text in English.",
      "acceptanceCriteria": [
        "For non-admin users, the Account Status page subtitle does not mention troubleshooting or deployment tools.",
        "For admin users, the page may mention admin tools if desired, but all displayed text remains English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AccountStatusPage.tsx",
          "operation": "modify",
          "description": "Update the header subtitle to be role-aware: show an admin-focused subtitle when callerIsAdmin is true, and a neutral account-focused English subtitle for non-admins that does not mention troubleshooting or deployment. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Prepare the UI and operator checklist text for publishing Draft Version 53 to live/production after the UI changes are applied.",
      "acceptanceCriteria": [
        "A live/production link is produced by the platform after the publish operation completes successfully.",
        "The live version reflects the Account Status page changes from REQ-1 and REQ-2 (non-admin users no longer see Troubleshooting or Publishing & Deployment sections)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/account/PrePublishGateCard.tsx",
          "operation": "modify",
          "description": "Update admin-only pre-publish guidance copy (English) to explicitly reference publishing Draft Version 53 to live/production and include a post-publish verification reminder to validate that non-admins no longer see the Troubleshooting and Publishing & Deployment sections. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/REGRESSION_CHECKLIST.md",
          "operation": "modify",
          "description": "Add/adjust regression checklist items (English) for the Draft v53 live publish verification: confirm non-admin Account Status view does not show Troubleshooting, Publishing & Deployment, or any #troubleshooting navigation; confirm admin view remains functional."
        }
      ]
    }
  ]
}