{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add publishing/deployment guidance and post-deploy verification UI on Account Status",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a “Publishing & Deployment” help section on the Account Status page with deploy-failure retry instructions and post-deploy cache troubleshooting guidance, including a direct link to the Troubleshooting tools.",
      "acceptanceCriteria": [
        "Account Status page includes a clearly titled “Publishing & Deployment” section with step-by-step guidance written in English.",
        "The guidance explicitly covers: (1) how to publish/deploy, (2) what to do when deploy fails (retry/rerun deployment), and (3) what to do when the deploy succeeds but UI doesn’t update (hard refresh + cache/service worker actions).",
        "The section contains a direct link/button that scrolls/navigates to the existing Troubleshooting tools on the same page (or opens them via the existing #troubleshooting anchor)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/account/PublishingDeploymentHelpSection.tsx",
          "operation": "create",
          "description": "Create a new Account Status help card/section titled “Publishing & Deployment” with English step-by-step guidance covering: how to publish/deploy, explicit instruction to rerun deployment if it fails, and a checklist for when changes aren’t visible after a successful deploy (hard refresh, reset app cache, disable offline cache/service worker). Include a Button/Link that navigates to the existing #troubleshooting anchor on the Account Status page. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AccountStatusPage.tsx",
          "operation": "modify",
          "description": "Wire the new PublishingDeploymentHelpSection into the Account Status page layout so it is easy to find (near the top, alongside other status/help content). Ensure TroubleshootingSection is accessible on the same page for users who can see the help section (so the #troubleshooting link works), while keeping other admin-only tools gated as appropriate."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Extend the Pre-Publish Gate UI with a “Post-deploy verification” subsection containing 3–5 verification checkboxes and a link to Troubleshooting for stale-asset/cache issues.",
      "acceptanceCriteria": [
        "Pre-Publish Gate shows a dedicated post-deploy verification subsection with checkboxes.",
        "Copy is in English and explicitly mentions using Troubleshooting actions if the new build appears not to be live due to caching.",
        "There is a link/button from the Pre-Publish Gate area to the Troubleshooting section (or the Account Status troubleshooting anchor)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/account/PrePublishGateCard.tsx",
          "operation": "modify",
          "description": "Add a new “Post-deploy verification” subsection to the existing Pre-Publish Gate card with 3–5 checkboxes focused on confirming the new version is live (e.g., confirm a visible version/footer change, reload without stale cache, confirm key routes load). Include English copy noting that if verification fails due to stale assets, the user should use the Troubleshooting tools to clear caches and then retry verification. Add a Button/Link to the Account Status page’s #troubleshooting anchor. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}